//
//  QuestionBrain.swift
//  millionaire
//
//  Created by Batman 👀 on 06.02.2023.
//

import UIKit

struct QuizMillionaire {
    let quiz = [  Question(a: "Возле какой горы-вулкана был впервые найден драгоценный камень танзанит?", b: ["Норвегия", "Кения", "Танзания", "Токио"], correctAnswer: "Танзания"),
                  Question(a: "Какой головной убор был во время бала на Татьяне Лариной, героине романа «Евгений Онегин»?", b: ["Папаха", "Малиновый берет", "Колпак", "Ушанка"], correctAnswer: "Малиновый берет"),
                  Question(a: "Какой продукт в разных странах называют папиной бородой и бабушкиными волосами?", b: ["Спагетти", "Сахарную вату", "Фунчоза", "Шашлык"], correctAnswer: "Сахарную вату"),
                  Question(a: "Как называется красная тряпка в руках у матадора?", b: ["Скатерть", "Юбка", "Мулета", "Саван"], correctAnswer: "Мулета"),
                  Question(a: "Какое астрономическое явление жители Земли могут наблюдать раз в 75–76 лет?", b: ["Появление кометы Галлея", "Солнечное затмение", "Полнолуние", "Конец света"], correctAnswer: "Появление кометы Галлея"),
                  Question(a: "Чьим детёнышем был пыжик, из меха которого в Советском Союзе делали зимние шапки?", b: ["Северного оленя", "Андатры", "Бобра", "Бизона"], correctAnswer: "Северного оленя"),
                  Question(a: "Скольким каратам соответствует чистое золото?", b: ["24-каратное", "23-каратное", "22-каратное", "21-каратное"], correctAnswer: "24-каратное"),
                  Question(a: "Какая из планет Солнечной системы самая горячая?", b: ["Венера", "Марс", "Юпитер", "Сатурн"], correctAnswer: "Венера"),
                  Question(a: "В каком немецком городе родилась будущая императрица России Екатерина II?", b: ["Штеттине", "Цербсте", "Берлин", "Шальке"], correctAnswer: "Штеттине"),
                  Question(a: "Как называют природный заповедник в отрогах Восточных Саян под Красноярском?", b: ["Заповедник Горы Восточных Саян", "Красноярские Столбы", "Заповедник Леса Восточных Саян", "Купеческий"], correctAnswer: "Красноярские Столбы"),
                  Question(a: "Кем приходились друг другу толстый и тонкий из одноимённого рассказа Чехова?", b: ["Коллегами", "Братьями", "Одноклассниками", "Ни кем"], correctAnswer: "Одноклассниками"),
                  Question(a: "Название какого алкогольного напитка переводится с немецкого как «полынь»?", b: ["Абсент", "Шнапс", "Абрикотин", "Вермут"], correctAnswer: "Вермут"),
                  Question(a: "Кто амнистировал всех оставшихся в живых декабристов, сосланных на Кавказ и в Сибирь?", b: ["Александр II", "Александр I", "Александр", "Николай I"], correctAnswer: "Александр II"),
                  Question(a: "Из какого цветка получают шафран — одну из самых дорогих пряностей?", b: ["Rosa", "Lilium", "Crocus sativus", "Tulipa"], correctAnswer: "Crocus sativus"),
                  Question(a: "В какое созвездие входит звезда Шаула, название которой переводится как «поднятый хвост»?", b: ["Лев", "Весы", "Водолей", "Скорпион"], correctAnswer: "Скорпион")
                  
    ]
}

